# language: pt-br

Funcionalidade: Formatar telefones

    Cenario: Números possíveis de serem formatados
        Dado que eu tenho o número "<numero>"
        E meu DDD padrão é "65"
        Quando eu formatar o número
        Então terei como resultado o número "<resultado>"

    Exemplos:
        | numero          | resultado        |
        | 92236269        | (065) 9223-6269  |
        | 9223-6269       | (065) 9223-6269  |
        | 65-9223-6269    | (065) 9223-6269  |
        | 065-9223-6269   | (065) 9223-6269  |
        | 06592236269     | (065) 9223-6269  |
        | 01199647493     | (011) 99964-7493 |
        | 11-9964-7493    | (011) 99964-7493 |
        | 011999647493    | (011) 99964-7493 |
        | 11-999647493    | (011) 99964-7493 |
        | 01130253243     | (011) 3025-3243  |
        | 11-30253243     | (011) 3025-3243  |
        | (041) 9203-6500 | (041) 9203-6500  |
        | +556592236269   | (065) 9223-6269  |
        | +5511980842531  | (011) 98084-2531 |
        | +551180842531   | (011) 98084-2531 |
        | +551130253243   | (011) 3025-3243  |
        | +11130253243    | +11130253243     |
        | 36 2331-81      | (065) 3623-3181  |
        | 079 9917-0414   | (079) 9917-0414  |
        | 9065-9223-6269  | (065) 9223-6269  |
        | 9011999647493   | (011) 99964-7493 |
        | 00556592236269  | (065) 9223-6269  |
        | 0011130253243   | +11130253243     |
        | 906536233181    | (065) 3623-3181  |
        | 190             | 190              |
        | 10325           | 10325            |

    Cenario: Números que não devem ser formatados
        Dado que eu tenho o número "<numero>"
        E meu DDD padrão é "65"
        Quando eu formatar o número
        Então deverá ocorrer um erro

    Exemplos:
        | numero        |
        | 999647493     |

